[
  {
    "img": "projects/1.webp",
    "title": "Ignite Timer",
    "description": "Este é um projeto criado na Trilha Ignite da Rocketseat onde foi desenvolvida uma aplicação web para gerenciamento de tempo onde o usuário dá um nome para a tarefa/projeto que irá executar e estima um tempo para realizá-la. A ideia é se assemelhar ao Método Pomodoro.",
    "githubURL": "https://github.com/israelnazareth/ignite-timer",
    "pageURL": "https://ignite-timer-five-wheat.vercel.app/"
  },
  {
    "img": "projects/2.webp",
    "title": "ToDo List",
    "description": "Este é um projeto criado na Trilha Ignite da Rocketseat onde foi desenvolvida uma aplicação web para gerenciamento de tarefas rotineiras do usuário. As principais tecnologias utilizadas neste projeto foram React.js, Vite.js e Typescript.",
    "githubURL": "https://github.com/israelnazareth/new-todo-list",
    "pageURL": "https://your-todo-list-two.vercel.app/"
  },
  {
    "img": "projects/3.webp",
    "title": "Ignite Feed",
    "description": "Este é um projeto criado na Trilha Ignite da Rocketseat onde foi desenvolvida uma página que simula um feed de redes sociais onde o usuário pode publicar, curtir ou excluir um comentário. As principais tecnologias utilizadas neste projeto foram React.js, Vite.js e Typescript.",
    "githubURL": "https://github.com/israelnazareth/ignite-feed",
    "pageURL": "https://github.com/israelnazareth/ignite-feed"
  },
  {
    "img": "projects/4.webp",
    "title": "Desafio Lacrei Front-end",
    "description": "Este foi um desafio técnico que pude desenvolver para um processo de trabalho voluntário para a ONG Lacrei. Consistia em criar uma página responsiva com rotas para a home page, pessoa usuária e profissional. O design foi fornecido pela organização através de um protótipo no Figma.",
    "githubURL": "https://github.com/israelnazareth/desafio-lacrei-frontend",
    "pageURL": "https://desafio-lacrei-frontend.vercel.app/"
  },
  {
    "img": "projects/5.webp",
    "title": "Waiter App",
    "description": "Esta é uma aplicação criada no evento O Poder do Javascript organizado pelo Desenvolvedor Mateus Silva que consiste em uma plataforma web e mobile com backend onde podemos gerenciar pedidos internos de restaurantes.",
    "githubURL": "https://github.com/israelnazareth/waiter-app",
    "pageURL": "https://github.com/israelnazareth/waiter-app"
  },
  {
    "img": "projects/6.webp",
    "title": "NLW Copa - Trilha Ignite",
    "description": "Esta é uma aplicação criada em um evento da Rocketseat que consiste em uma plataforma web e mobile com backend onde podemos criar bolões e fazer palpites dos jogos no tema da World Cup 2022.",
    "githubURL": "https://github.com/israelnazareth/nlwcopa-rocketseat",
    "pageURL": "https://nlwcopa-rocketseat.vercel.app/"
  },
  {
    "img": "projects/7.webp",
    "title": "Brazil News",
    "description": "Esta é uma aplicação que traz notícias atualizadas através de uma API, capaz de filtrá-las por categoria e ao clicar em um 'card' de notícia, redireciona o usuário para a fonte que a publicou. Caso esteja fora do ar, a aplicação pode ter atingido o limite de requisições diárias.",
    "githubURL": "https://github.com/israelnazareth/brazil-news-2.0",
    "pageURL": "https://brazil-news.vercel.app/"
  },
  {
    "img": "projects/8.webp",
    "title": "Ignite Lab - Design System",
    "description": "Esta foi uma participação em um evento online da Rocketseat. Aqui prototipamos o design do zero no Figma, criamos a aplicação usando o Vite com Typescript e ferramentas como Radix UI, Tailwind CSS, Storybook para documentar e fazer o deploy dos componentes.",
    "storybook": "https://israelnazareth.github.io/ignite-lab-design-system/",
    "githubURL": "https://github.com/israelnazareth/ignite-lab-design-system/",
    "pageURL": "https://ignite-lab-design-system-isn.vercel.app/"
  },
  {
    "img": "projects/9.webp",
    "title": "World Ranks",
    "description": "Esta é uma aplicação que traz informações e detalhes sobre países a partir de uma API, capaz de ordenar países por nome, tamanho da população, extensão territorial e Índice Gini.",
    "githubURL": "https://github.com/israelnazareth/world-ranks",
    "pageURL": "https://rankingtheworld.vercel.app/"
  },
  {
    "img": "projects/10.webp",
    "title": "Free Market",
    "description": "Este foi um projeto feito em grupo, uma versão simplificada de uma loja online que consome dados da API do Mercado Livre, capaz de detalhar o produto, adicionar a um carrinho e simular uma compra.",
    "githubURL": "https://github.com/israelnazareth/freemarket",
    "pageURL": "https://freemarket.vercel.app/"
  },
  {
    "img": "projects/11.webp",
    "title": "TrybeTunes",
    "description": "Esta é uma aplicação que consome dados da API do iTunes, capaz de reproduzir músicas dais mais variadas bandas e artistas, criar uma lista de músicas favoritas e editar o perfil da pessoa usuária logada.",
    "githubURL": "https://github.com/israelnazareth/trybetunes",
    "pageURL": "https://your-trybetunes.vercel.app/"
  },
  {
    "img": "projects/12.webp",
    "title": "Responsive Table Challenge",
    "description": "Este foi um desafio técnico que pude desenvolver para um processo seletivo de uma empresa. Consistia em criar uma tabela responsiva com dados mockados. O design foi fornecido pela empresa através de um protótipo no Figma.",
    "githubURL": "https://github.com/israelnazareth/responsive-table-challenge",
    "pageURL": "https://responsive-table-challenge.vercel.app/"
  }
]